<?php

namespace UZTranslit\WordsParser\Text;

use UZTranslit\WordsParser\HTML;
use UZTranslit\WordsParser\UTF8;

class TextWordsParser
{
	private $dot_reductions = [];
	private $re_langs       = [];

	public function __construct($langs = [
        'Arabic', 'Armenian', 'Balinese', 'Bengali', 'Bopomofo', 'Braille', 'Buginese',
        'Buhid', 'Canadian_Aboriginal', 'Cherokee', ' Coptic', ' Cuneiform',
        'Cypriot', 'Cyrillic', 'Deseret', 'Devanagari', 'Ethiopic', 'Georgian', 'Glagolitic',
        'Gothic', 'Greek', 'Gujarati', 'Gurmukhi', 'Han', 'Hangul', 'Hanunoo', 'Hebrew', 'Hiragana',
        'Kannada', 'Katakana', 'Kharoshthi', 'Khmer', 'Lao', 'Latin',
        'Limbu', 'Linear_B', 'Malayalam', 'Mongolian', 'Myanmar', 'New_Tai_Lue', 'Nko',
        'Ogham', 'Old_Italic', 'Old_Persian', 'Oriya', 'Osmanya', 'Phags_Pa', 'Phoenician',
        'Runic', 'Shavian', 'Sinhala', 'Syloti_Nagri', 'Syriac', 'Tagalog', 'Tagbanwa',
        'Tai_Le', 'Tamil', 'Telugu', 'Thaana', 'Thai', 'Tibetan', 'Tifinagh', 'Ugaritic', 'Yi',
    ]) {

		$this->dot_reductions = [
            'etc' => 'et cetera = и так далее',
            'абс' => 'абсолютный',
            'авг' => 'август',
            'авт' => 'автономный',
            'акад' => 'академический',
            'амер' => 'американский',
            'анат' => 'анатомический',
            'англ' => 'английский',
            'аннот' => 'аннотация',
            'антич' => 'античный',
            'апр' => 'апрель',
            'арифм' => 'арифметический',
            'арт' => 'артикул',
            'арх' => 'архаичный',
            'асс' => 'ассоциируется',
            'атм' => 'атмосфер',
            'ауд' => 'аудитория',
            'библ' => 'библиографический',
            'биогр' => 'биографический',
            'биол' => 'биологический',
            'буд' => 'будущее (время)',
            'букв' => 'буквально',
            'бюлл' => 'бюллютень',
            'вин' => 'винительный',
            'внеш' => 'внешний',
            'внутр' => 'внутренний',
            'воен' => 'военный',
            'вр' => 'время',
            'вс' => 'воскресенье',
            'вступ' => 'вступительное',
            'вт' => 'вторник',
            'вып' => 'выпуска',
            'геогр' => 'георгафический',
            'геол' => 'геологический',
            'гл' => 'глава',
            'глаг' => 'глагол',
            'гос' => 'государственный',
            'гр' => 'гражданин',
            'гражд' => 'гражданский',
            'греч' => 'греческий',
            'дат' => 'дательный (падеж)',
            'действ' => 'действенный (залог)',
            'дек' => 'декабрь',
            'деп' => 'депозит, депутат',
            'диал' => 'диалектное (слово)',
            'дист' => 'дистиллированный',
            'дн' => 'дней',
            'доб' => 'добавочный',
            'докт' => 'доктор',
            'долл' => 'доллары',
            'доп' => 'дополнительный',
            'доц' => 'доцент',
            'др' => 'другой',
            'дубл' => 'дубликат',
            'евр' => 'еврейский',
            'европ' => 'европейский',
            'ед' => 'единиц',
            'ежедн' => 'ежедневно',
            'ежемес' => 'ежемесячно',
            'еженед' => 'еженедельно',
            'журн' => 'журналист',
            'зав' => 'заведующий',
            'загл' => 'заглавный',
            'зак' => 'закупочная',
            'зап' => 'запасные (части)',
            'заруб' => 'зарубежный',
            'засл' => 'засланный',
            'зач' => 'зачёт',
            'знач' => 'значение',
            'избр' => 'избранное',
            'изв' => 'извещение',
            'изд' => 'издательство',
            'илл' => 'иллюстрация',
            'им' => 'имени',
            'инв' => 'инвестиции',
            'инд' => 'индекс',
            'инж' => 'инженер',
            'иностр' => 'иностранный',
            'инст' => 'институт',
            'исп' => 'испанский',
            'испр' => 'исправление',
            'иссл' => 'исследование',
            'ист' => 'историтеский',
            'истор' => 'историтеский',
            'исх' => 'исходящий',
            'итал' => 'итальянский',
            'июл' => 'июль',
            'июн' => 'июнь',
            'каб' => 'кабинет',
            'канд' => 'кндидат',
            'кач' => 'качественное',
            'кв' => 'квартира',
            'кл' => 'класс',
            'кн' => 'книга',
            'ком' => 'команда',
            'конф' => 'конференция',
            'конц' => 'концертный',
            'кооп' => 'коопрератив',
            'коп' => 'копейки',
            'кор' => 'коран',
            'корп' => 'корпус',
            'корр' => 'корреспондент',
            'коэфф' => 'коэффицент',
            'кр' => 'кроны',
            'крист' => 'кристальный',
            'лаб' => 'лаборатория',
            'лат' => 'латинский',
            'лингв' => 'лингвистический',
            'лит' => 'литературный',
            'магн' => 'магнитный',
            'макс' => 'максимальный',
            'мар' => 'март',
            'матем' => 'математический',
            'мед' => 'медицинский',
            'межд' => 'междометие',
            'междунар' => 'международный',
            'мес' => 'месяц',
            'мест' => 'местоимение',
            'мин' => 'минут',
            'млн' => '',
            'млрд' => '',
            'моск' => 'московский',
            'наб' => 'набережная',
            'наз' => 'называется',
            'назв' => 'название',
            'наим' => 'наименование',
            'напр' => 'направление',
            'нареч' => 'наречие',
            'наст' => 'настоящее (время)',
            'науч' => 'научный',
            'нац' => 'национальный',
            'нач' => 'начало',
            'неизв' => 'неизвестный',
            'неизм' => 'неизменный',
            'нем' => 'немецкий',
            'неодуш' => 'неодушевленный',
            'неопр' => 'неопределенная форма глагола',
            'неперех' => 'непереходный (глагол)',
            'несов' => 'несовершенный вид (глагола)',
            'ниж' => 'нижний',
            'нояб' => 'ноябрь',
            'обл' => 'область',
            'обст' => 'обстоятельство',
            'одновр' => 'одновременно',
            'окр' => 'округ',
            'окт' => 'октябрь',
            'опр' => 'определение',
            'оптим' => 'оптимальный',
            'опубл' => 'опубликованный',
            'орг' => 'организация',
            'ориг' => 'оригинальный',
            'осн' => 'основной',
            'ост' => 'остановка',
            'отв' => 'ответственный',
            'отд' => 'отдел',
            'отеч' => 'отечественый',
            'отл' => 'отличие',
            'отн' => 'относительно',
            'оф' => 'офис',
            'пад' => 'падеж',
            'пед' => 'педагогический',
            'перем' => 'переменный',
            'перех' => 'переходный',
            'петерб' => 'петербургский',
            'пл' => 'площадь',
            'пн' => 'понедельник',
            'повелит' => 'повелительное (наклонение)',
            'подл' => 'подлежащее',
            'подп' => 'подпункт',
            'полн' => 'полный',
            'пом' => 'помещение',
            'пос' => 'поселок',
            'посв' => 'посвящается',
            'посл' => 'последнее',
            'поч' => 'почетный',
            'пп' => 'подпункт',
            'пр' => 'прочее',
            'предисл' => 'предисловие',
            'предл' => 'предложение, предложный (падеж)',
            'предс' => 'председатель',
            'предст' => 'представитель',
            'преимущ' => 'преимущественно',
            'преп' => 'преподаватель',
            'прибл' => 'приблизительно',
            'прил' => 'прилагательное',
            'примеч' => 'примечание',
            'прит' => 'притяжательное (прилагательное)',
            'прич' => 'причастие',
            'пров' => 'проверено',
            'прогр' => 'программа',
            'прод' => 'продуктовый',
            'произв' => 'производственный',
            'пром' => 'промышленный',
            'просп' => 'проспект',
            'проф' => 'профессия',
            'проч' => 'прочий',
            'прош' => 'прошедшее (время)',
            'психол' => 'психологический',
            'пт' => 'пятница',
            'публ' => 'публикация',
            'разв' => 'развитие',
            'разг' => 'разговорное (слово)',
            'разд' => 'раздельный',
            'разл' => 'различный',
            'разр' => 'разрешенный',
            'распр' => 'распределение',
            'раст' => 'растительный',
            'рег' => 'регулярное',
            'регул.' => 'регулярное, регулируется',
            'ред' => 'редакция',
            'редк' => 'редкий',
            'реж' => 'режиссер',
            'религ' => 'религиозный',
            'респ' => 'республиканский',
            'реф' => 'реформа',
            'рис' => 'рисунок',
            'род' => 'родительный (падеж)',
            'рожд' => 'рождения',
            'росс' => 'российский',
            'руб' => 'рублей',
            'рук' => 'руководитель',
            'рукоп' => 'рукопашный',
            'санскр' => 'санскрипт',
            'сб' => 'суббота',
            'св' => 'святой',
            'свящ' => 'священный',
            'сен' => 'сентябрь',
            'сент' => 'сентябрь',
            'симф' => 'симфонический',
            'сист' => 'системный',
            'сказ' => 'сказуемое',
            'скл' => 'склонение',
            'см' => 'смотри, сантиметры',
            'собр' => 'собрание',
            'сов' => 'советский, совершенный вид (глагола)',
            'совр' => 'современный',
            'согл' => 'согласованный, согласно',
            'соед' => 'соеденительный',
            'сокр' => 'сокращенный',
            'соотв' => 'соответствует',
            'сост' => 'составной',
            'сотр' => 'сотрудник',
            'соц' => 'социальный',
            'соч' => 'сочинений (собрание)',
            'спец' => 'специальный',
            'спр' => 'справочник',
            'ср' => 'сравни(те), средний',
            'сс' => 'страница',
            'ст' => 'станция',
            'стат' => 'статистический',
            'стр' => 'страница',
            'страдат' => 'страдательный (залог)',
            'сут' => 'суточный',
            'сущ' => 'существенный, существительное',
            'сч' => 'счет',
            'табл' => 'таблица',
            'твор' => 'творительный (падеж)',
            'тел' => 'телефон',
            'телегр' => 'телеграф',
            'телеф' => 'телефон',
            'теор' => 'теоретический',
            'терр' => 'территориальный',
            'техн' => 'технический',
            'теч' => 'течение',
            'тов' => 'товарищ, товар',
            'тыс' => 'тысяча',
            'тюркск' => 'тюркский',
            'увелич' => 'увеличительное',
            'укр' => 'украинский',
            'ул' => 'улица',
            'уменьш' => 'уменьшительное',
            'упак' => 'упакованный',
            'упр' => 'упражнение',
            'усл' => 'условный',
            'устар' => 'устарелое (слово)',
            'уч' => 'учебный',
            'фев' => 'февраль',
            'физ' => 'физический',
            'фил' => 'филиал',
            'филол' => 'филологический',
            'филос' => 'философский',
            'фин' => 'финансовый',
            'фр' => 'французский',
            'франц' => 'французский',
            'хим' => 'химический',
            'хоз' => 'хозяйственный',
            'худож' => 'художественны',
            'цв' => 'цвет',
            'церк' => 'церковный',
            'числ' => 'численный',
            'чл' => 'член',
            'чт' => 'черверг',
            'шк' => 'школьный',
            'шт' => 'штук',
            'эквив' => 'эквивалентный',
            'экз' => 'экземпляр',
            'эксп' => 'экспозиция',
            'яз' => 'язык',
            'янв' => 'январь',
            'японск' => 'японский',
        ];

		$this->re_langs = self::_re_langs($langs);
	}

	public function parse($s, &$words = null, &$sentences = null, &$uniques = null, &$offset_map = null)
    {
		$s = $this->normalize($s);
		preg_match_all('~(?>#1 letters
							(	#\p{L}++
								(?>' . $this->re_langs . ')
								#special
								(?>		\#     (?!\p{L}|\d)		#programming languages: C#
									|	\+\+?+ (?!\p{L}|\d)		#programming languages: C++, T++, B+ trees, Европа+; but not C+E, C+5
								)?+
							)

							#2 numbers
							|	(	\d++            #digits
									(?> % (?!\p{L}|\d) )?+	#brand names: 120%
								)
							#|	\p{Nd}++  #decimal number
							#|	\p{Nl}++  #letter number
							#|	\p{No}++  #other number

							#paragraph (see self::normalize())
							|	\r\r

							#sentence end by dot
							|	\. (?=[\x20'
										. "\xc2\xa0"   #U+00A0 [ ] no-break space = non-breaking space
										. '] (?!\p{Ll})  #following symbol not letter in lowercase
									)

							#sentence end by other
							|	(?<!\()    #previous symbol not bracket
								[!?;…]++  #sentence end
								#following symbol not
								(?!["\)'
									. "\xc2\xbb"       #U+00BB [»] right-pointing double angle quotation mark = right pointing guillemet
									. "\xe2\x80\x9d"   #U+201D [”] right double quotation mark
									. "\xe2\x80\x99"   #U+2019 [’] right single quotation mark (and apostrophe!)
									. "\xe2\x80\x9c"   #U+201C [“] left double quotation mark
									. ']
								)
						)
						~sxuSX', $s, $m, PREG_OFFSET_CAPTURE | PREG_SET_ORDER);

		$words = [];
		$sentences = [];
		$uniques = [];
		$offset_map = [];

		$sentence_pos = 0;
		$abs_pos = 0;
		$w_prev = false;

		foreach ($m as $i => $a) {
			$is_alpha = $is_digit = false;
			if ($is_digit = array_key_exists(2, $a)) {
                list($w, $pos) = $a[2];
            } elseif ($is_alpha = array_key_exists(1, $a)) {
                list($w, $pos) = $a[1];
            } else {
				list($w, $pos) = $a[0];
				if ($w !== '.') {
					if (!empty($sentences[$sentence_pos])) {
						$w_prev = false;
						$sentence_pos++;
					}
					continue;
				}
				if (!empty($sentences[$sentence_pos])) {
					$tmp = $w_prev;
					$w_prev = false;
					if ($tmp === false ||
                        (UTF8::strlen($tmp) < 2 && ! ctype_digit($tmp)) ||
                        (is_array($this->dot_reductions) &&
                        array_key_exists(UTF8::lowercase($tmp), $this->dot_reductions))) {
                        continue;
                    }

					$sentence_pos++;
				}
				continue;
			}
			$w_prev = $w;
			$words[$abs_pos] = $w;
			$sentences[$sentence_pos][$abs_pos] =& $words[$abs_pos];
			$offset_map[$abs_pos] = $pos;
			$abs_pos++;
		}

		$uniques = array_count_values(explode(PHP_EOL, UTF8::lowercase(implode(PHP_EOL, $words))));
		ksort($uniques, SORT_REGULAR);
		return $s;
	}

	public function weights($uniques, $base = 65535)
	{
		$total = array_sum($uniques);
		foreach ($uniques as $k => &$v) $v = round(($v / $total) * $base);
		return $uniques;
	}

	public function normalize($s)
	{
		$s = HTML::strip_tags($s, null, true, ['noindex', 'script', 'noscript', 'style', 'map', 'iframe', 'frameset', 'object', 'applet', 'comment', 'button', 'textarea', 'select']);
		$s = HTML::entity_decode($s, $is_htmlspecialchars = true);

		$trans = [
            "\xc2\xad" => '',
            "\t" => ' ',
            "\f" => "\r\n\r\n",
        ];
		$s = strtr($s, $trans);
		$s = UTF8::diactrical_remove($s);
		return preg_replace('~(\r\n|[\r\n])(?:\x20|\\1)+~sSX', "\r\r", $s);
	}

	public function structure($s)
	{
		#see HTML::normalize_links()
	}

	private static function _filename($type)
	{
		$a = explode('_', __CLASS__);
		$name = end($a);
		return __DIR__ . 'WordsParser.php/' . $name . '.' . $type . '.php';
	}

	private static function _re_langs($langs)
	{
		$a = [];
		foreach ($langs as $lang) {
            $a[] = '\p{' . preg_quote($lang, '~') . '}++';
        }

		return implode($a, ' | ');
	}
}